RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/inc/hc32_ll_eth.h
/*
  Enhance DMA Tx Descriptor
  -----------------------------------------------------------------------------------------------
  TDES4 |                                Reserved[31:0]                                          |
  -----------------------------------------------------------------------------------------------
  TDES5 |                                Reserved[31:0]                                          |
  -----------------------------------------------------------------------------------------------
  TDES6 |                         Transmit Time Stamp Low [31:0]                                 |
  -----------------------------------------------------------------------------------------------
  TDES7 |                         Transmit Time Stamp High [31:0]                                |
  -----------------------------------------------------------------------------------------------
 */
/**
 * @brief Bit definition of TDES6 register
 */
#define ETH_DMA_TXDESC_TTSL                        (0xFFFFFFFFUL)  /*!< Transmit Time Stamp Low */

/**
 * @brief Bit definition of TDES7 register
 */
#define ETH_DMA_TXDESC_TTSH                        (0xFFFFFFFFUL)  /*!< Transmit Time Stamp High */

/**
 * @}
 */

/**
 * @defgroup ETH_DMA_RX_Descriptor ETH DMA RX Descriptor
 * @{
 */

/*
  Normal DMA Rx Descriptor
  --------------------------------------------------------------------------------------------------------------------
  RDES0 | OWN(31) |                                             Status [30:0]                                          |
  ---------------------------------------------------------------------------------------------------------------------
  RDES1 | CTRL(31) | Reserved[30:29] | Buffer2 ByteCount[28:16] | CTRL[15:14] | Reserved(13) | Buffer1 ByteCount[12:0] |
  ---------------------------------------------------------------------------------------------------------------------
  RDES2 |                                       Buffer1 Address [31:0]                                                 |
  ---------------------------------------------------------------------------------------------------------------------
  RDES3 |                          Buffer2 Address [31:0] / Next Descriptor Address [31:0]                             |
  ---------------------------------------------------------------------------------------------------------------------
*/
/**
 * @brief Bit definition of RDES0 register
 */
#define ETH_DMA_RXDESC_OWN                          (0x80000000UL)  /*!< OWN bit */
#define ETH_DMA_RXDESC_DAF                          (0x40000000UL)  /*!< Destination Address Filter Fail for the received frame */
#define ETH_DMA_RXDESC_FRAL                         (0x3FFF0000UL)  /*!< Receive frame length */
#define ETH_DMA_RXDESC_ERSUM                        (0x00008000UL)  /*!< Rx Error summary: OR of the following bits: DPE || OVE || IPE_TSPA_GF || RLCE || WTE || REE || CRE in RDES0, or IPPE || IPHE in RDES4 */
#define ETH_DMA_RXDESC_DPE                          (0x00004000UL)  /*!< Descriptor Error: no more descriptors for receive frame */
#define ETH_DMA_RXDESC_SAF                          (0x00002000UL)  /*!< Source address Filter Fail for the received frame */
#define ETH_DMA_RXDESC_LEE                          (0x00001000UL)  /*!< Length Error: Frame size not matching with length field */
#define ETH_DMA_RXDESC_OVE                          (0x00000800UL)  /*!< Overflow Error: Frame was damaged due to buffer overflow */
#define ETH_DMA_RXDESC_VLAT                         (0x00000400UL)  /*!< VLAN Tag: received frame is a VLAN frame */
#define ETH_DMA_RXDESC_RFS                          (0x00000200UL)  /*!< First descriptor */
#define ETH_DMA_RXDESC_RLS                          (0x00000100UL)  /*!< Last descriptor */
#define ETH_DMA_RXDESC_IPE_TSPA_GF                  (0x00000080UL)  /*!< COE Error or Time stamp valid or jumbo frame */
#define ETH_DMA_RXDESC_RLCE                         (0x00000040UL)  /*!< Late collision Error */
#define ETH_DMA_RXDESC_FRAT                         (0x00000020UL)  /*!< Frame type: Ethernet or PTP */
#define ETH_DMA_RXDESC_WTE                          (0x00000010UL)  /*!< Receive Watchdog Timeout */
#define ETH_DMA_RXDESC_REE                          (0x00000008UL)  /*!< Receive error: error reported by PHY RX_ER */
#define ETH_DMA_RXDESC_DBE                          (0x00000004UL)  /*!< Dribble bit error: frame contains non int multiple of 8 bits  */
#define ETH_DMA_RXDESC_CRE                          (0x00000002UL)  /*!< CRC error */
#define ETH_DMA_RXDESC_DAS_ESA                      (0x00000001UL)  /*!< MAC Address Filter/Status bit extension */
#define ETH_DMA_RXDESC_STATUS_ALL                   (ETH_DMA_RXDESC_OWN | ETH_DMA_RXDESC_DAF  | ETH_DMA_RXDESC_ERSUM | \
                                                     ETH_DMA_RXDESC_DPE | ETH_DMA_RXDESC_CRE  | ETH_DMA_RXDESC_LEE   | \
                                                     ETH_DMA_RXDESC_OVE | ETH_DMA_RXDESC_VLAT | ETH_DMA_RXDESC_RFS   | \
                                                     ETH_DMA_RXDESC_RLS | ETH_DMA_RXDESC_SAF  | ETH_DMA_RXDESC_RLCE  | \
                                                     ETH_DMA_RXDESC_WTE | ETH_DMA_RXDESC_FRAT | ETH_DMA_RXDESC_REE   | \
                                                     ETH_DMA_RXDESC_DBE | ETH_DMA_RXDESC_DAS_ESA                     | \
                                                     ETH_DMA_RXDESC_IPE_TSPA_GF)

/**
 * @brief Bit definition of RDES1 register
 */
#define ETH_DMA_RXDESC_DIC                          (0x80000000UL)  /*!< Disable Interrupt on Completion */
#define ETH_DMA_RXDESC_RBS2                         (0x1FFF0000UL)  /*!< Receive Buffer2 Size */
#define ETH_DMA_RXDESC_RER                          (0x00008000UL)  /*!< Receive End of Ring */
#define ETH_DMA_RXDESC_RSAC                         (0x00004000UL)  /*!< Second Address Chained */
#define ETH_DMA_RXDESC_RBS1                         (0x00001FFFUL)  /*!< Receive Buffer1 Size */

/**
 * @brief Bit definition of RDES2 register
 */
#define ETH_DMA_RXDESC_RBAP1                        (0xFFFFFFFFUL)  /*!< Buffer1 Address Pointer */

/**
 * @brief Bit definition of RDES3 register
 */
#define ETH_DMA_RXDESC_RBAP2                        (0xFFFFFFFFUL)  /*!< Buffer2 Address Pointer */

