RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/inc/hc32_ll_eth.h
/*
  Enhance DMA Rx Descriptor
  -----------------------------------------------------------------------------------------------
  RDES4 |    Reserved[31:26] | Extend Status [25:24] | Reserved[23:15] | Extend Status [14:0]    |
  -----------------------------------------------------------------------------------------------
  RDES5 |                                    Reserved[31:0]                                      |
  -----------------------------------------------------------------------------------------------
  RDES6 |                               Receive Time Stamp Low [31:0]                            |
  -----------------------------------------------------------------------------------------------
  RDES7 |                               Receive Time Stamp High [31:0]                           |
  -----------------------------------------------------------------------------------------------
*/
/**
 * @brief Bit definition of RDES4 register
 */
#define ETH_DMA_RXDESC_L4FMS                        (0x02000000UL)  /*!< L4 Port Filter Status */
#define ETH_DMA_RXDESC_L3FMS                        (0x01000000UL)  /*!< L3 Address Filter Status */
#define ETH_DMA_RXDESC_TSPD                         (0x00004000UL)  /*!< Discard Time Stamp */
#define ETH_DMA_RXDESC_PTPV                         (0x00002000UL)  /*!< PTP Version */
#define ETH_DMA_RXDESC_PTPFT                        (0x00001000UL)  /*!< PTP Frame Type */
#define ETH_DMA_RXDESC_MTP                          (0x00000F00UL)  /*!< PTP Datagram Type */
#define ETH_DMA_RXDESC_MTP_NONE                     (0x00000000UL)  /*!< No PTP messages */
#define ETH_DMA_RXDESC_MTP_SYNC                     (0x00000100UL)  /*!< SYNC message (all clock types) */
#define ETH_DMA_RXDESC_MTP_FOLLOW_UP                (0x00000200UL)  /*!< Follow_Up message (all clock types) */
#define ETH_DMA_RXDESC_MTP_DELAY_REQ                (0x00000300UL)  /*!< Delay_Req message (all clock types) */
#define ETH_DMA_RXDESC_MTP_DELAY_RESP               (0x00000400UL)  /*!< Delay_Resp message (all clock types) */
#define ETH_DMA_RXDESC_MTP_PDELAY_REQ               (0x00000500UL)  /*!< Pdelay_Req message (peer-to-peer transparent clock) */
#define ETH_DMA_RXDESC_MTP_PDELAY_RESP              (0x00000600UL)  /*!< Pdelay_Resp message (peer-to-peer transparent clock) */
#define ETH_DMA_RXDESC_MTP_PDELAY_RESP_FOLLOW_UP    (0x00000700UL)  /*!< Pdelay_Resp_Follow_Up message (peer-to-peer transparent clock) */
#define ETH_DMA_RXDESC_MTP_ANNOUNCE                 (0x00000800UL)  /*!< Announce message (Ordinary or Boundary clock) */
#define ETH_DMA_RXDESC_MTP_MANAGEMENT               (0x00000900UL)  /*!< Management message (Ordinary or Boundary clock) */
#define ETH_DMA_RXDESC_MTP_SIGNALING                (0x00000A00UL)  /*!< Signaling message (Ordinary or Boundary clock) */
#define ETH_DMA_RXDESC_MTP_DEFAULT                  (0x00000F00UL)  /*!< Default Datagram Type */
#define ETH_DMA_RXDESC_IPV6DR                       (0x00000080UL)  /*!< IPv6 Packet Received */
#define ETH_DMA_RXDESC_IPV4DR                       (0x00000040UL)  /*!< IPv4 Packet Received */
#define ETH_DMA_RXDESC_IPCB                         (0x00000020UL)  /*!< COE engine Bypassed */
#define ETH_DMA_RXDESC_IPPE                         (0x00000010UL)  /*!< IP Payload Error */
#define ETH_DMA_RXDESC_IPHE                         (0x00000008UL)  /*!< IP Header Error */
#define ETH_DMA_RXDESC_IPPT                         (0x00000007UL)  /*!< IP Payload Type: 4 cases */
#define ETH_DMA_RXDESC_IPPT_UNKNOWN                 (0x00000000UL)  /*!< Unknown */
#define ETH_DMA_RXDESC_IPPT_UDP                     (0x00000001UL)  /*!< UDP */
#define ETH_DMA_RXDESC_IPPT_TCP                     (0x00000002UL)  /*!< TCP */
#define ETH_DMA_RXDESC_IPPT_ICMP                    (0x00000003UL)  /*!< ICMP */
#define ETH_DMA_RXDESC_EXTEND_STATUS_ALL            (ETH_DMA_RXDESC_L4FMS  | ETH_DMA_RXDESC_L3FMS  | \
                                                     ETH_DMA_RXDESC_TSPD   | ETH_DMA_RXDESC_PTPV   | \
                                                     ETH_DMA_RXDESC_PTPFT  | ETH_DMA_RXDESC_IPV6DR | \
                                                     ETH_DMA_RXDESC_IPV4DR | ETH_DMA_RXDESC_IPCB   | \
                                                     ETH_DMA_RXDESC_IPPE   | ETH_DMA_RXDESC_IPHE)

/**
 * @brief Bit definition of RDES6 register
 */
#define ETH_DMA_RXDESC_RTSL                         (0xFFFFFFFFUL)  /*!< Receive Time Stamp Low */

/**
 * @brief Bit definition of RDES7 register
 */
#define ETH_DMA_RXDESC_RTSH                         (0xFFFFFFFFUL)  /*!< Receive Time Stamp High */

/**
 * @}
 */

/**
 * @defgroup ETH_Auto_Negotiation ETH Auto Negotiation
 * @{
 */
#define ETH_AUTO_NEGO_DISABLE                       (0x0000U)
#define ETH_AUTO_NEGO_ENABLE                        (0x0001U)
/**
 * @}
 */

/**
 * @defgroup ETH_Interface ETH Interface
 * @{
 */
#define ETH_MAC_IF_MII                              (0UL)
#define ETH_MAC_IF_RMII                             (ETH_MAC_IFCONFR_IFSEL)
/**
 * @}
 */

/**
 * @defgroup ETH_Speed ETH Speed
 * @{
 */
#define ETH_MAC_SPEED_10M                           (0UL)
#define ETH_MAC_SPEED_100M                          (ETH_MAC_CONFIGR_FES)
/**
 * @}
 */

/**
 * @defgroup ETH_Duplex_Mode ETH Duplex Mode
 * @{
 */
#define ETH_MAC_DUPLEX_MD_HALF                      (0UL)
#define ETH_MAC_DUPLEX_MD_FULL                      (ETH_MAC_CONFIGR_DM)
/**
 * @}
 */

/**
 * @defgroup ETH_Checksum_Mode ETH Checksum Mode
 * @{
 */
#define ETH_MAC_CHECKSUM_MD_SW                      (0UL)
#define ETH_MAC_CHECKSUM_MD_HW                      (0x00000001UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_Mode ETH Receive Mode
 * @{
 */
#define ETH_RX_MD_POLLING                           (0UL)
#define ETH_RX_MD_INT                               (0x00000001UL)
/**
 * @}
 */

/**
 * @defgroup ETH_TX_CLK_POLARITY ETH TX Clock Polarity
 * @{
 */
#define ETH_MAC_TX_CLK_POLARITY_KEEP                (0UL)
#define ETH_MAC_TX_CLK_POLARITY_INVERSE             (ETH_MAC_IFCONFR_TCKINV)
/**
 * @}
 */

/**
 * @defgroup ETH_RX_CLK_POLARITY ETH RX Clock Polarity
 * @{
 */
#define ETH_MAC_RX_CLK_POLARITY_KEEP                (0UL)
#define ETH_MAC_RX_CLK_POLARITY_INVERSE             (ETH_MAC_IFCONFR_RCKINV)
/**
 * @}
 */

/**
 * @defgroup ETH_SRC_ADDR_Mode ETH Source Address Mode
 * @{
 */
#define ETH_MAC_SRC_ADDR_MD_BY_DMA_TXDESC           (0UL)                                   /*!< Configure the Insert mode by Tx Descriptor of DMA */
#define ETH_MAC_SRC_ADDR_MD_INSERT_MACADDR0         (0x02UL << ETH_MAC_CONFIGR_SAIRC_POS)   /*!< Insert address value in MAC address register 0 into transmit frame as source address */
#define ETH_MAC_SRC_ADDR_MD_REPLACE_MACADDR0        (0x03UL << ETH_MAC_CONFIGR_SAIRC_POS)   /*!< Replace source address in transmit frame with address value in MAC address register 0 */
#define ETH_MAC_SRC_ADDR_MD_INSERT_MACADDR1         (0x06UL << ETH_MAC_CONFIGR_SAIRC_POS)   /*!< Insert address value in MAC address register 1 into transmit frame as source address */
#define ETH_MAC_SRC_ADDR_MD_REPLACE_MACADDR1        (0x07UL << ETH_MAC_CONFIGR_SAIRC_POS)   /*!< Replace source address in transmit frame with address value in MAC address register 1 */
/**
 * @}
 */

/**
 * @defgroup ETH_TypeFrame_Strip_FCS ETH Type Frame Strip FCS
 * @{
 */
#define ETH_MAC_TYPE_FRAME_STRIP_FCS_DISABLE        (0UL)
#define ETH_MAC_TYPE_FRAME_STRIP_FCS_ENABLE         (ETH_MAC_CONFIGR_CST)
/**
 * @}
 */

/**
 * @defgroup ETH_Watchdog ETH Watchdog
 * @{
 */
#define ETH_MAC_WATCHDOG_DISABLE                    (ETH_MAC_CONFIGR_MWD)
#define ETH_MAC_WATCHDOG_ENABLE                     (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Jabber ETH Jabber
 * @{
 */
#define ETH_MAC_JABBER_DISABLE                      (ETH_MAC_CONFIGR_MJB)
#define ETH_MAC_JABBER_ENABLE                       (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Interframe_Gap ETH Interframe Gap
 * @{
 */
#define ETH_MAC_INTERFRAME_GAP_96BIT                (0UL)
#define ETH_MAC_INTERFRAME_GAP_88BIT                (0x01UL << ETH_MAC_CONFIGR_IFG_POS)
#define ETH_MAC_INTERFRAME_GAP_80BIT                (0x02UL << ETH_MAC_CONFIGR_IFG_POS)
#define ETH_MAC_INTERFRAME_GAP_72BIT                (0x03UL << ETH_MAC_CONFIGR_IFG_POS)
#define ETH_MAC_INTERFRAME_GAP_64BIT                (0x04UL << ETH_MAC_CONFIGR_IFG_POS)
#define ETH_MAC_INTERFRAME_GAP_56BIT                (0x05UL << ETH_MAC_CONFIGR_IFG_POS)
#define ETH_MAC_INTERFRAME_GAP_48BIT                (0x06UL << ETH_MAC_CONFIGR_IFG_POS)
#define ETH_MAC_INTERFRAME_GAP_40BIT                (0x07UL << ETH_MAC_CONFIGR_IFG_POS)
/**
 * @}
 */

/**
 * @defgroup ETH_Carrier_Sense ETH Carrier Sense
 * @{
 */
#define ETH_MAC_CARRIER_SENSE_DISABLE               (ETH_MAC_CONFIGR_DCRS)
#define ETH_MAC_CARRIER_SENSE_ENABLE                (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_Own ETH Receive Own
 * @{
 */
#define ETH_MAC_RX_OWN_DISABLE                      (ETH_MAC_CONFIGR_DO)
#define ETH_MAC_RX_OWN_ENABLE                       (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Checksum_Offload ETH Checksum Offload
 * @{
 */
#define ETH_MAC_CHECKSUM_OFFLOAD_DISABLE            (0UL)
#define ETH_MAC_CHECKSUM_OFFLOAD_ENABLE             (ETH_MAC_CONFIGR_IPCO)
/**
 * @}
 */

/**
 * @defgroup ETH_Retry_Transmit ETH Retry Transmit
 * @{
 */
#define ETH_MAC_RETRY_TRANS_DISABLE                 (ETH_MAC_CONFIGR_DRTY)
#define ETH_MAC_RETRY_TRANS_ENABLE                  (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Auto_Strip_Pad_FCS ETH Auto Strip Pad FCS
 * @{
 */
#define ETH_MAC_AUTO_STRIP_PAD_FCS_DISABLE          (0UL)
#define ETH_MAC_AUTO_STRIP_PAD_FCS_ENABLE           (ETH_MAC_CONFIGR_ACS)
/**
 * @}
 */

/**
 * @defgroup ETH_Back_Off_Limit ETH Back Off Limit
 * @{
 */
#define ETH_MAC_BACKOFF_LIMIT10                     (0UL)
#define ETH_MAC_BACKOFF_LIMIT8                      (ETH_MAC_CONFIGR_BL_0)
#define ETH_MAC_BACKOFF_LIMIT4                      (ETH_MAC_CONFIGR_BL_1)
#define ETH_MAC_BACKOFF_LIMIT1                      (ETH_MAC_CONFIGR_BL)
/**
 * @}
 */

/**
 * @defgroup ETH_Deferral_Check ETH Deferral Check
 * @{
 */
#define ETH_MAC_DEFERRAL_CHECK_DISABLE              (0UL)
#define ETH_MAC_DEFERRAL_CHECK_ENABLE               (ETH_MAC_CONFIGR_DC)
/**
 * @}
 */

/**
 * @defgroup ETH_Zero_Quanta_Pause ETH Zero Quanta Pause
 * @{
 */
#define ETH_MAC_ZERO_QUANTA_PAUSE_DISABLE           (ETH_MAC_FLOCTLR_DZPQ)
#define ETH_MAC_ZERO_QUANTA_PAUSE_ENABLE            (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Pause_Low_Threshold ETH Pause Low Threshold
 * @{
 */
#define ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS4          (0UL)                   /*!< Pause time minus 4 slot times */
#define ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS28         (ETH_MAC_FLOCTLR_PLT_0) /*!< Pause time minus 28 slot times */
#define ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS144        (ETH_MAC_FLOCTLR_PLT_1) /*!< Pause time minus 144 slot times */
#define ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS256        (ETH_MAC_FLOCTLR_PLT)   /*!< Pause time minus 256 slot times */
/**
 * @}
 */

/**
 * @defgroup ETH_Unicast_Pause_Frame_Detect ETH Unicast Pause Frame Detect
 * @{
 */
#define ETH_MAC_UNICAST_PAUSE_FRAME_DETECT_DISABLE  (0UL)
#define ETH_MAC_UNICAST_PAUSE_FRAME_DETECT_ENABLE   (ETH_MAC_FLOCTLR_UNP)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_Flow_Control ETH Receive Flow Control
 * @{
 */
#define ETH_MAC_RX_FLOW_CTRL_DISABLE                (0UL)
#define ETH_MAC_RX_FLOW_CTRL_ENABLE                 (ETH_MAC_FLOCTLR_RFE)
/**
 * @}
 */

/**
 * @defgroup ETH_Transmit_Flow_Control ETH Transmit Flow Control
 * @{
 */
#define ETH_MAC_TRANS_FLOW_CTRL_DISABLE             (0UL)
#define ETH_MAC_TRANS_FLOW_CTRL_ENABLE              (ETH_MAC_FLOCTLR_TFE)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_All ETH Receive All
 * @{
 */
#define ETH_MAC_RX_ALL_DISABLE                      (0UL)
#define ETH_MAC_RX_ALL_ENABLE                       (ETH_MAC_FLTCTLR_RA)
/**
 * @}
 */

/**
 * @defgroup ETH_Drop_Not_TcpUdp ETH Drop Not TcpUdp
 * @{
 */
#define ETH_MAC_DROP_NOT_TCPUDP_DISABLE             (0UL)
#define ETH_MAC_DROP_NOT_TCPUDP_ENABLE              (ETH_MAC_FLTCTLR_DNTU)
/**
 * @}
 */

/**
 * @defgroup ETH_VLAN_Tag_Filter ETH VLAN Tag Filter
 * @{
 */
#define ETH_MAC_VLAN_TAG_FILTER_DISABLE             (0UL)
#define ETH_MAC_VLAN_TAG_FILTER_ENABLE              (ETH_MAC_FLTCTLR_VTFE)
/**
 * @}
 */

/**
 * @defgroup ETH_Source_Addr_Filter ETH Source Addr Filter
 * @{
 */
#define ETH_MAC_SRC_ADDR_FILTER_DISABLE             (0UL)
#define ETH_MAC_SRC_ADDR_FILTER_NORMAL              (ETH_MAC_FLTCTLR_SAF)
#define ETH_MAC_SRC_ADDR_FILTER_INVERSE             (ETH_MAC_FLTCTLR_SAF | ETH_MAC_FLTCTLR_SAIF)
/**
 * @}
 */

/**
 * @defgroup ETH_Pass_Control_Frame ETH Pass Control Frame
 * @{
 */
#define ETH_MAC_PASS_CTRL_FRAME_BLOCK_ALL                   (0UL)                   /*!< MAC filter all control frame from reaching the application */
#define ETH_MAC_PASS_CTRL_FRAME_FORWARD_NOT_PAUSE           (ETH_MAC_FLTCTLR_PCF_0) /*!< MAC forward all control frame except pause control frame to application even if they fail the address filter */
#define ETH_MAC_PASS_CTRL_FRAME_FORWARD_ALL                 (ETH_MAC_FLTCTLR_PCF_1) /*!< MAC forward all control frame to application even if they fail the address filter */
#define ETH_MAC_PASS_CTRL_FRAME_FORWARD_PASS_FILTER         (ETH_MAC_FLTCTLR_PCF)   /*!< MAC forward control frame that pass the address filter. */
/**
 * @}
 */

/**
 * @defgroup ETH_Reception_Broadcast_Frame ETH Reception Broadcast Frame
 * @{
 */
#define ETH_MAC_RX_BROADCAST_FRAME_DISABLE                  (ETH_MAC_FLTCTLR_DBF)
#define ETH_MAC_RX_BROADCAST_FRAME_ENABLE                   (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Destination_Addr_Filter ETH Destination Addr Filter
 * @{
 */
#define ETH_MAC_DEST_ADDR_FILTER_NORMAL             (0UL)
#define ETH_MAC_DEST_ADDR_FILTER_INVERSE            (ETH_MAC_FLTCTLR_DAIF)
/**
 * @}
 */

/**
 * @defgroup ETH_Multicast_Frame_Filter ETH Multicast Frame Filter
 * @{
 */
#define ETH_MAC_MULTICAST_FRAME_FILTER_NONE                 (ETH_MAC_FLTCTLR_PMF)
#define ETH_MAC_MULTICAST_FRAME_FILTER_PERFECT              (0UL)
#define ETH_MAC_MULTICAST_FRAME_FILTER_HASHTABLE            (ETH_MAC_FLTCTLR_HMC)
#define ETH_MAC_MULTICAST_FRAME_FILTER_PERFECT_HASHTABLE    (ETH_MAC_FLTCTLR_HPF | ETH_MAC_FLTCTLR_HMC)
/**
 * @}
 */

/**
 * @defgroup ETH_Unicast_Frame_Filter ETH Unicast Frame Filter
 * @{
 */
#define ETH_MAC_UNICAST_FRAME_FILTER_PERFECT                (0UL)
#define ETH_MAC_UNICAST_FRAME_FILTER_HASHTABLE              (ETH_MAC_FLTCTLR_HUC)
#define ETH_MAC_UNICAST_FRAME_FILTER_PERFECT_HASHTABLE      (ETH_MAC_FLTCTLR_HPF | ETH_MAC_FLTCTLR_HUC)
/**
 * @}
 */

/**
 * @defgroup ETH_Promiscuous_Mode ETH Promiscuous Mode
 * @{
 */
#define ETH_MAC_PROMISCUOUS_MD_DISABLE              (0UL)
#define ETH_MAC_PROMISCUOUS_MD_ENABLE               (ETH_MAC_FLTCTLR_PR)
/**
 * @}
 */

/**
 * @defgroup ETH_Tx_VLAN_Insert_Mode ETH Tx VLAN Insert Mode
 * @{
 */
#define ETH_MAC_TXVLAN_MD_BY_DMA_TXDESC             (0UL)                                               /*!< Configure the Tx VLAN mode by Tx Descriptor of DMA */
#define ETH_MAC_TXVLAN_MD_BYPASS                    (ETH_MAC_VTACTLR_VLANS)                             /*!< Do Nothing: VLAN Insertion is bypassed */
#define ETH_MAC_TXVLAN_MD_REMOVE_TAG                (ETH_MAC_VTACTLR_VLANS | ETH_MAC_VTACTLR_VLANC_0)   /*!< Remove Tag and Type fields in VLAN frame */
#define ETH_MAC_TXVLAN_MD_INSERT_TAG                (ETH_MAC_VTACTLR_VLANS | ETH_MAC_VTACTLR_VLANC_1)   /*!< Insert VLAN Tag value in ETH_MAC_VTACTLR Register into transmit frame */
#define ETH_MAC_TXVLAN_MD_REPLACE_TAG               (ETH_MAC_VTACTLR_VLANS | ETH_MAC_VTACTLR_VLANC)     /*!< Replace VLAN tag value in transmit frame with VLAN tag value in ETH_MAC_VTACTLR register */
/**
 * @}
 */

/**
 * @defgroup ETH_Rx_VLAN_Filter ETH Rx VLAN Filter
 * @{
 */
#define ETH_MAC_RXVLAN_FILTER_NORMAL                (0UL)
#define ETH_MAC_RXVLAN_FILTER_INVERSE               (ETH_MAC_VTAFLTR_VTIM)
#define ETH_MAC_RXVLAN_FILTER_NORMAL_HASHTABLE      (ETH_MAC_VTAFLTR_VTHM)
#define ETH_MAC_RXVLAN_FILTER_INVERSE_HASHTABLE     (ETH_MAC_VTAFLTR_VTHM | ETH_MAC_VTAFLTR_VTIM)
/**
 * @}
 */

/**
 * @defgroup ETH_Rx_VLAN_Compare ETH Rx VLAN Compare
 * @{
 */
#define ETH_MAC_RXVLAN_CMP_16BIT                    (0UL)
#define ETH_MAC_RXVLAN_CMP_12BIT                    (ETH_MAC_VTAFLTR_VTAL)
/**
 * @}
 */

/**
 * @defgroup ETH_L4_Dest_Port_Filter ETH L4 Dest Port Filter
 * @{
 */
#define ETH_MAC_L4_DEST_PORT_FILTER_DISABLE         (0UL)
#define ETH_MAC_L4_DEST_PORT_FILTER_NORMAL          (ETH_MAC_L34CTLR_L4DPM)
#define ETH_MAC_L4_DEST_PORT_FILTER_INVERSE         (ETH_MAC_L34CTLR_L4DPIM | ETH_MAC_L34CTLR_L4DPM)
/**
 * @}
 */

/**
 * @defgroup ETH_L4_Source_Port_Filter ETH L4 Source Port Filter
 * @{
 */
#define ETH_MAC_L4_SRC_PORT_FILTER_DISABLE          (0UL)
#define ETH_MAC_L4_SRC_PORT_FILTER_NORMAL           (ETH_MAC_L34CTLR_L4SPM)
#define ETH_MAC_L4_SRC_PORT_FILTER_INVERSE          (ETH_MAC_L34CTLR_L4SPIM | ETH_MAC_L34CTLR_L4SPM)
/**
 * @}
 */

/**
 * @defgroup ETH_L4_Port_Filter_Protocol ETH L4 Port Filter Protocol
 * @{
 */
#define ETH_MAC_L4_PORT_FILTER_PROTOCOL_TCP         (0UL)                   /*!< Port filter for TCP frame */
#define ETH_MAC_L4_PORT_FILTER_PROTOCOL_UDP         (ETH_MAC_L34CTLR_L4PEN) /*!< Port filter for UDP frame */
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Dest_Addr_Filter_Mask ETH L3 Destination Addr Filter Mask
 * @note The following definitions apply to IPv4.
 * @{
 */
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_NONE       (0x00000000UL)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT0       (0x01UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT1_0     (0x02UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT2_0     (0x03UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT3_0     (0x04UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT4_0     (0x05UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT5_0     (0x06UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT6_0     (0x07UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT7_0     (0x08UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT8_0     (0x09UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT9_0     (0x0AUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT10_0    (0x0BUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT11_0    (0x0CUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT12_0    (0x0DUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT13_0    (0x0EUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT14_0    (0x0FUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT15_0    (0x10UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT16_0    (0x11UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT17_0    (0x12UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT18_0    (0x13UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT19_0    (0x14UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT20_0    (0x15UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT21_0    (0x16UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT22_0    (0x17UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT23_0    (0x18UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT24_0    (0x19UL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT25_0    (0x1AUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT26_0    (0x1BUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT27_0    (0x1CUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT28_0    (0x1DUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT29_0    (0x1EUL << ETH_MAC_L34CTLR_L3HDBM_POS)
#define ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT30_0    (0x1FUL << ETH_MAC_L34CTLR_L3HDBM_POS)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Source_Addr_Filter_Mask ETH L3 Source Addr Filter Mask
 * @note The following definitions apply to IPv4
 * @{
 */
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_NONE        (0x00000000UL)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT0        (0x01UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT1_0      (0x02UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT2_0      (0x03UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT3_0      (0x04UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT4_0      (0x05UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT5_0      (0x06UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT6_0      (0x07UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT7_0      (0x08UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT8_0      (0x09UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT9_0      (0x0AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT10_0     (0x0BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT11_0     (0x0CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT12_0     (0x0DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT13_0     (0x0EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT14_0     (0x0FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT15_0     (0x10UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT16_0     (0x11UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT17_0     (0x12UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT18_0     (0x13UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT19_0     (0x14UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT20_0     (0x15UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT21_0     (0x16UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT22_0     (0x17UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT23_0     (0x18UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT24_0     (0x19UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT25_0     (0x1AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT26_0     (0x1BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT27_0     (0x1CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT28_0     (0x1DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT29_0     (0x1EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT30_0     (0x1FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
/**
 * @}
 */

