RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/inc/hc32_ll_eth.h
/**
 * @defgroup ETH_L3_Dest_Source_Addr_Filter_Mask ETH L3 Destination Source Address Filter Mask
 * @note The following definitions apply to IPv6.
 * @{
 */
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_NONE           (0x00000000UL)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT0           (0x01UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT1_0         (0x02UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT2_0         (0x03UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT3_0         (0x04UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT4_0         (0x05UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT5_0         (0x06UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT6_0         (0x07UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT7_0         (0x08UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT8_0         (0x09UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT9_0         (0x0AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT10_0        (0x0BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT11_0        (0x0CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT12_0        (0x0DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT13_0        (0x0EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT14_0        (0x0FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT15_0        (0x10UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT16_0        (0x11UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT17_0        (0x12UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT18_0        (0x13UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT19_0        (0x14UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT20_0        (0x15UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT21_0        (0x16UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT22_0        (0x17UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT23_0        (0x18UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT24_0        (0x19UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT25_0        (0x1AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT26_0        (0x1BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT27_0        (0x1CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT28_0        (0x1DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT29_0        (0x1EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT30_0        (0x1FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT31_0        (0x20UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT32_0        (0x21UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT33_0        (0x22UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT34_0        (0x23UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT35_0        (0x24UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT36_0        (0x25UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT37_0        (0x26UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT38_0        (0x27UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT39_0        (0x28UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT40_0        (0x29UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT41_0        (0x2AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT42_0        (0x2BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT43_0        (0x2CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT44_0        (0x2DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT45_0        (0x2EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT46_0        (0x2FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT47_0        (0x30UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT48_0        (0x31UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT49_0        (0x32UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT50_0        (0x33UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT51_0        (0x34UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT52_0        (0x35UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT53_0        (0x36UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT54_0        (0x37UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT55_0        (0x38UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT56_0        (0x39UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT57_0        (0x3AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT58_0        (0x3BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT59_0        (0x3CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT60_0        (0x3DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT61_0        (0x3EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT62_0        (0x3FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT63_0        (0x40UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT64_0        (0x41UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT65_0        (0x42UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT66_0        (0x43UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT67_0        (0x44UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT68_0        (0x45UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT69_0        (0x46UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT70_0        (0x47UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT71_0        (0x48UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT72_0        (0x49UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT73_0        (0x4AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT74_0        (0x4BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT75_0        (0x4CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT76_0        (0x4DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT77_0        (0x4EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT78_0        (0x4FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT79_0        (0x50UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT80_0        (0x51UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT81_0        (0x52UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT82_0        (0x53UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT83_0        (0x54UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT84_0        (0x55UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT85_0        (0x56UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT86_0        (0x57UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT87_0        (0x58UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT88_0        (0x59UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT89_0        (0x5AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT90_0        (0x5BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT91_0        (0x5CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT92_0        (0x5DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT93_0        (0x5EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT94_0        (0x5FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT95_0        (0x60UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT96_0        (0x61UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT97_0        (0x62UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT98_0        (0x63UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT99_0        (0x64UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT100_0       (0x65UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT101_0       (0x66UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT102_0       (0x67UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT103_0       (0x68UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT104_0       (0x69UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT105_0       (0x6AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT106_0       (0x6BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT107_0       (0x6CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT108_0       (0x6DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT109_0       (0x6EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT110_0       (0x6FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT111_0       (0x70UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT112_0       (0x71UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT113_0       (0x72UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT114_0       (0x73UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT115_0       (0x74UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT116_0       (0x75UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT117_0       (0x76UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT118_0       (0x77UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT119_0       (0x78UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT120_0       (0x79UL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT121_0       (0x7AUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT122_0       (0x7BUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT123_0       (0x7CUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT124_0       (0x7DUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT125_0       (0x7EUL << ETH_MAC_L34CTLR_L3HSBM_POS)
#define ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT126_0       (0x7FUL << ETH_MAC_L34CTLR_L3HSBM_POS)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Dest_Addr_Filter ETH L3 Destination Addr Filter
 * @{
 */
#define ETH_MAC_L3_DEST_ADDR_FILTER_DISABLE         (0UL)
#define ETH_MAC_L3_DEST_ADDR_FILTER_NORMAL          (ETH_MAC_L34CTLR_L3DAM)
#define ETH_MAC_L3_DEST_ADDR_FILTER_INVERSE         (ETH_MAC_L34CTLR_L3DAIM | ETH_MAC_L34CTLR_L3DAM)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Source_Addr_Filter ETH L3 Source Addr Filter
 * @{
 */
#define ETH_MAC_L3_SRC_ADDR_FILTER_DISABLE          (0UL)
#define ETH_MAC_L3_SRC_ADDR_FILTER_NORMAL           (ETH_MAC_L34CTLR_L3SAM)
#define ETH_MAC_L3_SRC_ADDR_FILTER_INVERSE          (ETH_MAC_L34CTLR_L3SAIM | ETH_MAC_L34CTLR_L3SAM)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Addr_Filter_Protocol ETH L3 Addr Filter Protocol
 * @{
 */
#define ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV4        (0UL)                   /*!< Ip Address filter for IPv4 */
#define ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV6        (ETH_MAC_L34CTLR_L3PEN) /*!< Ip Address filter for IPv6 */
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Address_Index ETH MAC Address Index
 * @{
 */
#define ETH_MAC_ADDR_IDX0                           (0x00000000UL)
#define ETH_MAC_ADDR_IDX1                           (0x00000008UL)
#define ETH_MAC_ADDR_IDX2                           (0x00000010UL)
#define ETH_MAC_ADDR_IDX3                           (0x00000018UL)
#define ETH_MAC_ADDR_IDX4                           (0x00000020UL)
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Address_Filter ETH MAC Address Filter
 * @note The parameter is invalid in ETH_MAC_ADDR_IDX0.
 * @{
 */
#define ETH_MAC_ADDR_FILTER_DISABLE                 (0UL)                                           /*!< Disable perfect filter with MAC address. */
#define ETH_MAC_ADDR_FILTER_PERFECT_DEST_ADDR       (ETH_MAC_MACADHR1_AE1)                          /*!< Filter the Destination address of the received frame with MAC address. */
#define ETH_MAC_ADDR_FILTER_PERFECT_SRC_ADDR        (ETH_MAC_MACADHR1_AE1 | ETH_MAC_MACADHR1_SA1)   /*!< Filter the source address of the received frame with MAC address. */
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Address_Filter_Mask ETH MAC Address Filter Mask
 * @note The parameter is invalid in ETH_MAC_ADDR_IDX0.
 * @{
 */
#define ETH_MAC_ADDR_MASK_DISABLE                   (0UL)                       /*!< Disable MAC Address Mask */
#define ETH_MAC_ADDR_MASK_BYTE6                     (ETH_MAC_MACADHR1_MBC1_5)   /*!< Mask MAC Address high reg bits [15:8] */
#define ETH_MAC_ADDR_MASK_BYTE5                     (ETH_MAC_MACADHR1_MBC1_4)   /*!< Mask MAC Address high reg bits [7:0] */
#define ETH_MAC_ADDR_MASK_BYTE4                     (ETH_MAC_MACADHR1_MBC1_3)   /*!< Mask MAC Address low reg bits [31:24] */
#define ETH_MAC_ADDR_MASK_BYTE3                     (ETH_MAC_MACADHR1_MBC1_2)   /*!< Mask MAC Address low reg bits [23:16] */
#define ETH_MAC_ADDR_MASK_BYTE2                     (ETH_MAC_MACADHR1_MBC1_1)   /*!< Mask MAC Address low reg bits [15:8] */
#define ETH_MAC_ADDR_MASK_BYTE1                     (ETH_MAC_MACADHR1_MBC1_0)   /*!< Mask MAC Address low reg bits [7:0] */
#define ETH_MAC_ADDR_MASK_ALL                       (ETH_MAC_MACADHR1_MBC1)     /*!< Mask MAC Address low reg bits [31:0] and low high bits [15:0] */
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_INT_Flag ETH MAC Interrupt Flag
 * @{
 */
#define ETH_MAC_INT_FLAG_TSPIS                      (ETH_MAC_INTSTSR_TSPIS)     /*!< Time stamp trigger flag (on MAC) */
#define ETH_MAC_INT_FLAG_MMCTXIS                    (ETH_MAC_INTSTSR_MMCTXIS)   /*!< MMC transmit flag  */
#define ETH_MAC_INT_FLAG_MMCRXIS                    (ETH_MAC_INTSTSR_MMCRXIS)   /*!< MMC receive flag */
#define ETH_MAC_INT_FLAG_MMCIS                      (ETH_MAC_INTSTSR_MMCIS)     /*!< MMC flag (on MAC) */
#define ETH_MAC_INT_FLAG_PMTIS                      (ETH_MAC_INTSTSR_PMTIS)     /*!< PMT flag (on MAC) */
#define ETH_MAC_INT_FLAG_ALL                        (ETH_MAC_INT_FLAG_TSPIS   | ETH_MAC_INT_FLAG_MMCTXIS | \
                                                     ETH_MAC_INT_FLAG_MMCRXIS | ETH_MAC_INT_FLAG_MMCIS   | \
                                                     ETH_MAC_INT_FLAG_PMTIS)
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Interrupt ETH MAC Interrupt
 * @{
 */
#define ETH_MAC_INT_TSPIM                           (ETH_MAC_INTMSKR_TSPIM)   /*!< Time stamp trigger interrupt (on MAC) */
#define ETH_MAC_INT_PMTIM                           (ETH_MAC_INTMSKR_PMTIM)   /*!< PMT interrupt (on MAC) */
#define ETH_MAC_INT_ALL                             (ETH_MAC_INT_TSPIM | ETH_MAC_INT_PMTIM)
/**
 * @}
 */

/**
 * @defgroup ETH_Burst_Mode ETH Burst Mode
 * @{
 */
#define ETH_DMA_BURST_MD_NORMAL                     (0UL)                     /*!< DMA master interface only use SINGLE and INCR access type */
#define ETH_DMA_BURST_MD_FIXED                      (ETH_DMA_BUSMODR_FBST)    /*!< DMA master interface use SINGLE and INCR, INCR8, INCR16 access type */
#define ETH_DMA_BURST_MD_MIXED                      (ETH_DMA_BUSMODR_MBST)    /*!< DMA master interface will start all burst transmission with INCR length greater than 16 */
/**
 * @}
 */

/**
 * @defgroup ETH_Address_Align ETH Address Align
 * @{
 */
#define ETH_DMA_ADDR_ALIGN_DISABLE                  (0UL)
#define ETH_DMA_ADDR_ALIGN_ENABLE                   (ETH_DMA_BUSMODR_AAL)
/**
 * @}
 */

/**
 * @defgroup ETH_Rx_DMA_Burst_Length ETH Rx DMA Burst Length
 * @{
 */
#define ETH_DMA_RX_BURST_LEN_1BEAT                  (ETH_DMA_BUSMODR_RPBL_0)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 1 */
#define ETH_DMA_RX_BURST_LEN_2BEAT                  (ETH_DMA_BUSMODR_RPBL_1)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 2 */
#define ETH_DMA_RX_BURST_LEN_4BEAT                  (ETH_DMA_BUSMODR_RPBL_2)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMA_RX_BURST_LEN_8BEAT                  (ETH_DMA_BUSMODR_RPBL_3)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMA_RX_BURST_LEN_16BEAT                 (ETH_DMA_BUSMODR_RPBL_4)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMA_RX_BURST_LEN_32BEAT                 (ETH_DMA_BUSMODR_RPBL_5)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMA_RX_BURST_LEN_8XPBL_8BEAT            (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_0)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMA_RX_BURST_LEN_8XPBL_16BEAT           (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_1)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMA_RX_BURST_LEN_8XPBL_32BEAT           (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_2)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMA_RX_BURST_LEN_8XPBL_64BEAT           (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_3)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 64 */
#define ETH_DMA_RX_BURST_LEN_8XPBL_128BEAT          (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_4)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 128 */
#define ETH_DMA_RX_BURST_LEN_8XPBL_256BEAT          (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_5)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 256 */
/**
 * @}
 */

/**
 * @defgroup ETH_Tx_DMA_Burst_Length ETH Tx DMA Burst Length
 * @{
 */
#define ETH_DMA_TX_BURST_LEN_1BEAT                  (ETH_DMA_BUSMODR_TPBL_0)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
#define ETH_DMA_TX_BURST_LEN_2BEAT                  (ETH_DMA_BUSMODR_TPBL_1)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
#define ETH_DMA_TX_BURST_LEN_4BEAT                  (ETH_DMA_BUSMODR_TPBL_2)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMA_TX_BURST_LEN_8BEAT                  (ETH_DMA_BUSMODR_TPBL_3)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMA_TX_BURST_LEN_16BEAT                 (ETH_DMA_BUSMODR_TPBL_4)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMA_TX_BURST_LEN_32BEAT                 (ETH_DMA_BUSMODR_TPBL_5)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMA_TX_BURST_LEN_8XPBL_8BEAT            (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_0)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMA_TX_BURST_LEN_8XPBL_16BEAT           (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_1)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMA_TX_BURST_LEN_8XPBL_32BEAT           (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_2)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMA_TX_BURST_LEN_8XPBL_64BEAT           (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_3)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
#define ETH_DMA_TX_BURST_LEN_8XPBL_128BEAT          (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_4)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */
#define ETH_DMA_TX_BURST_LEN_8XPBL_256BEAT          (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_5)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 256 */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Enhance_Descriptor ETH DMA Enhance Descriptor
 * @{
 */
#define ETH_DMA_ENHANCE_DESC_DISABLE                (0UL)
#define ETH_DMA_ENHANCE_DESC_ENABLE                 (ETH_DMA_BUSMODR_DSEN)
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Arbitration ETH DMA Arbitration
 * @{
 */
#define ETH_DMA_ARBITRATION_LOOP_RXTX_1_1           (0UL)
#define ETH_DMA_ARBITRATION_LOOP_RXTX_2_1           (ETH_DMA_BUSMODR_PRAT_0)
#define ETH_DMA_ARBITRATION_LOOP_RXTX_3_1           (ETH_DMA_BUSMODR_PRAT_1)
#define ETH_DMA_ARBITRATION_LOOP_RXTX_4_1           (ETH_DMA_BUSMODR_PRAT)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_1_1           (ETH_DMA_BUSMODR_TXPR)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_2_1           (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT_0)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_3_1           (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT_1)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_4_1           (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT)
#define ETH_DMA_ARBITRATION_FIXED_RX_PRIOR_TX       (ETH_DMA_BUSMODR_DMAA)
#define ETH_DMA_ARBITRATION_FIXED_TX_PRIOR_RX       (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_DMAA)
/**
 * @}
 */

