RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/inc/hc32_ll_eth.h
/**
 * @defgroup ETH_MMC_Rx_Interrupt ETH MMC Rx Interrupt
 * @{
 */
#define ETH_MMC_INT_RXOEIM                          (ETH_MMC_RITCTLR_RXOEIM)   /*!< Rx out of scope error frame interrupt */
#define ETH_MMC_INT_RXLEIM                          (ETH_MMC_RITCTLR_RXLEIM)   /*!< Rx length error frame interrupt */
#define ETH_MMC_INT_RXUGIM                          (ETH_MMC_RITCTLR_RXUGIM)   /*!< Rx unicast good frame interrupt */
#define ETH_MMC_INT_RXREIM                          (ETH_MMC_RITCTLR_RXREIM)   /*!< Rx short error frame interrupt */
#define ETH_MMC_INT_RXAEIM                          (ETH_MMC_RITCTLR_RXAEIM)   /*!< Rx alignment error frame interrupt */
#define ETH_MMC_INT_RXCEIM                          (ETH_MMC_RITCTLR_RXCEIM)   /*!< Rx crc error frame interrupt */
#define ETH_MMC_INT_RXMGIM                          (ETH_MMC_RITCTLR_RXMGIM)   /*!< Rx multicast good frame interrupt */
#define ETH_MMC_INT_RXBGIM                          (ETH_MMC_RITCTLR_RXBGIM)   /*!< Rx broadcast good frame interrupt */
#define ETH_MMC_INT_RX_ALL                          (ETH_MMC_INT_RXOEIM | ETH_MMC_INT_RXLEIM | ETH_MMC_INT_RXUGIM | \
                                                     ETH_MMC_INT_RXREIM | ETH_MMC_INT_RXAEIM | ETH_MMC_INT_RXCEIM | \
                                                     ETH_MMC_INT_RXMGIM | ETH_MMC_INT_RXBGIM)
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Statistical_Register ETH MMC Statistical Register
 * @{
 */
#define ETH_MMC_REG_TXBRGFR                         (0x011CU)   /*!< Tx broadcast good frame Statistical Register */
#define ETH_MMC_REG_TXMUGFR                         (0x0120U)   /*!< Tx multicast good frame Statistical Register */
#define ETH_MMC_REG_TXDEEFR                         (0x0154U)   /*!< Tx deferral error frame Statistical Register */
#define ETH_MMC_REG_TXLCEFR                         (0x0158U)   /*!< Tx deferral collision error frame Statistical Register */
#define ETH_MMC_REG_TXECEFR                         (0x015CU)   /*!< Tx excessive collision error frame Statistical Register */
#define ETH_MMC_REG_TXCAEFR                         (0x0160U)   /*!< Tx carrier error frame Statistical Register */
#define ETH_MMC_REG_TXUNGFR                         (0x0168U)   /*!< Tx unicast good frame Statistical Register */
#define ETH_MMC_REG_TXEDEFR                         (0x016CU)   /*!< Tx excessive deferral error frame Statistical Register */
#define ETH_MMC_REG_RXBRGFR                         (0x018CU)   /*!< Rx broadcast good frame Statistical Register */
#define ETH_MMC_REG_RXMUGFR                         (0x0190U)   /*!< Rx multicast good frame Statistical Register */
#define ETH_MMC_REG_RXCREFR                         (0x0194U)   /*!< Rx crc error frame Statistical Register */
#define ETH_MMC_REG_RXALEFR                         (0x0198U)   /*!< Rx alignment error frame Statistical Register */
#define ETH_MMC_REG_RXRUEFR                         (0x019CU)   /*!< Rx short error frame Statistical Register */
#define ETH_MMC_REG_RXUNGFR                         (0x01C4U)   /*!< Rx unicast good frame Statistical Register */
#define ETH_MMC_REG_RXLEEFR                         (0x01C8U)   /*!< Rx length error frame Statistical Register */
#define ETH_MMC_REG_RXOREFR                         (0x01CCU)   /*!< Rx out of scope error frame Statistical Register */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Frame_Dest_Addr_Filter ETH PTP Frame Destination Address Filter
 * @{
 */
#define ETH_PTP_DEST_ADDR_FILTER_DISABLE            (0x00800000UL)
#define ETH_PTP_DEST_ADDR_FILTER_ENABLE             (ETH_PTP_TSPCTLR_TSPADF)
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Snapshot_Datagram_Type ETH PTP Snapshot Datagram Type
 * @{
 */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY             (0UL)                                       /*!< SYNC Follow_Up Delay_Req Delay_Resp */
#define ETH_PTP_DATAGRAM_TYPE_SYNC                          (0x01UL << ETH_PTP_TSPCTLR_TSPMTSEL_POS)    /*!< SYNC */
#define ETH_PTP_DATAGRAM_TYPE_DELAY                         (0x03UL << ETH_PTP_TSPCTLR_TSPMTSEL_POS)    /*!< Delay_Req */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY_PDELAY      (0x04UL << ETH_PTP_TSPCTLR_TSPMTSEL_POS)    /*!< SYNC Follow_Up Delay_Req Delay_Resp Pdelay_Req Pdelay_Resp Pdelay_Resp_Follow_Up */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_PDELAY                   (0x05UL << ETH_PTP_TSPCTLR_TSPMTSEL_POS)    /*!< SYNC Pdelay_Req Pdelay_Resp */
#define ETH_PTP_DATAGRAM_TYPE_DELAY_PDELAY                  (0x07UL << ETH_PTP_TSPCTLR_TSPMTSEL_POS)    /*!< Delay_Req Pdelay_Req Pdelay_Resp */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_DELAY                    (0x08UL << ETH_PTP_TSPCTLR_TSPMTSEL_POS)    /*!< SYNC Delay_Req */
#define ETH_PTP_DATAGRAM_TYPE_PDELAY                        (0x0CUL << ETH_PTP_TSPCTLR_TSPMTSEL_POS)    /*!< Pdelay_Req Pdelay_Resp */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Snapshot_Frame_Type ETH PTP Snapshot Frame Type
 * @{
 */
#define ETH_PTP_FRAME_TYPE_IPV4_FRAME               (ETH_PTP_TSPCTLR_TSPOVIPV4) /*!< Time stamp snapshot for IPv4 frame */
#define ETH_PTP_FRAME_TYPE_IPV6_FRAME               (ETH_PTP_TSPCTLR_TSPOVIPV6) /*!< Time stamp snapshot for IPv6 frame */
#define ETH_PTP_FRAME_TYPE_ETH_FRAME                (ETH_PTP_TSPCTLR_TSPOVETH)  /*!< Time stamp snapshot for PTP over ethernet frame */
#define ETH_PTP_FRAME_TYPE_RX_FRAME                 (ETH_PTP_TSPCTLR_TSPEALL)   /*!< Time stamp snapshot for all received frame */
#define ETH_PTP_FRAME_TYPE_ALL                      (ETH_PTP_FRAME_TYPE_IPV4_FRAME | \
                                                     ETH_PTP_FRAME_TYPE_IPV6_FRAME | \
                                                     ETH_PTP_FRAME_TYPE_ETH_FRAME  | \
                                                     ETH_PTP_FRAME_TYPE_RX_FRAME)
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Datagram_Version ETH PTP Datagram Version
 * @{
 */
#define ETH_PTP_DATAGRAM_VER_IEEE1588V1             (0UL)
#define ETH_PTP_DATAGRAM_VER_IEEE1588V2             (ETH_PTP_TSPCTLR_TSPVER)
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Subsecond_Scale ETH PTP Subsecond Scale
 * @{
 */
#define ETH_PTP_SUBSEC_SCALE_HEX                    (0UL)                     /*!< The Second register increase 1 when SubSecond count to 0x7FFFFFFFH */
#define ETH_PTP_SUBSEC_SCALE_DEC                    (ETH_PTP_TSPCTLR_TSPSSR)  /*!< The Second register increase 1 when SubSecond count to 0x3B9AC9FFH */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Calibration_Mode ETH PTP Calibration Mode
 * @{
 */
#define ETH_PTP_CALIB_MD_COARSE                     (0UL)                       /*!< Coarse calibration */
#define ETH_PTP_CALIB_MD_FINE                       (ETH_PTP_TSPCTLR_TSPUPSEL)  /*!< Fine calibration */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Time_Update_Sign ETH PTP Time Update Sign
 * @{
 */
#define ETH_PTP_TIME_UPDATE_SIGN_MINUS              (0UL)                       /*!< Minus for update register value */
#define ETH_PTP_TIME_UPDATE_SIGN_PLUS               (ETH_PTP_TMUNSER_TSPUPNS)   /*!< Plus for update register value */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Flag ETH PTP Flag
 * @{
 */
#define ETH_PTP_FLAG_TSERR1                         (ETH_PTP_TSPSTSR_TSERR1)  /*!< Target time 1 error */
#define ETH_PTP_FLAG_TSTAR1                         (ETH_PTP_TSPSTSR_TSTAR1)  /*!< Target time 1 reached  */
#define ETH_PTP_FLAG_TSERR0                         (ETH_PTP_TSPSTSR_TSERR0)  /*!< Target time 0 error */
#define ETH_PTP_FLAG_TSTAR0                         (ETH_PTP_TSPSTSR_TSTAR0)  /*!< Target time 0 reached */
#define ETH_PTP_FLAG_TSOVF                          (ETH_PTP_TSPSTSR_TSOVF)   /*!< System time overflow */
#define ETH_PTP_FLAG_ALL                            (ETH_PTP_FLAG_TSERR1 | ETH_PTP_FLAG_TSTAR1 | ETH_PTP_FLAG_TSERR0 | \
                                                     ETH_PTP_FLAG_TSTAR0 | ETH_PTP_FLAG_TSOVF)
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Channel ETH PPS Channel
 * @{
 */
#define ETH_PPS_CH0                                 (0x00U)
#define ETH_PPS_CH1                                 (0x01U)
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Trigger_Function ETH PPS Trigger Function
 * @{
 */
#define ETH_PPS_TRIG_FUNC_INT_EVT                   (0UL)                       /*!< The Target register is used only for interrupt output event */
#define ETH_PPS_TRIG_FUNC_INT_PPS_EVT               (ETH_PTP_PPSCTLR_TT0SEL_1)  /*!< The Target register is used for interrupt out event and PPS single output event */
#define ETH_PPS_TRIG_FUNC_PPS_EVT                   (ETH_PTP_PPSCTLR_TT0SEL)    /*!< The Target register is used for PPS single output event */
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Output_Mode ETH PPS Output Mode
 * @note PPS1(ETH_PPS_CH1) only supports single output mode(ETH_PPS_OUTPUT_MD_ONCE).
 * @{
 */
#define ETH_PPS_OUTPUT_MD_CONTINUE                  (0UL)                     /*!< Continuous output mode */
#define ETH_PPS_OUTPUT_MD_ONCE                      (ETH_PTP_PPSCTLR_PPSOMD)  /*!< Once output mode */
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Output_Frequency ETH PPS Output Frequency
 * @note PPS1(ETH_PPS_CH1) only supports generate a pulse(ETH_PPS_OUTPUT_ONE_PULSE).
 * @{
 */
#define ETH_PPS_OUTPUT_FREQ_1HZ                     (0UL)                                   /*!< Ouput pulse is 1HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_2HZ                     (0x01UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 2HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_4HZ                     (0x02UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 4HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_8HZ                     (0x03UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 8HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_16HZ                    (0x04UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 16HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_32HZ                    (0x05UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 32HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_64HZ                    (0x06UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 64HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_128HZ                   (0x07UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 128HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_256HZ                   (0x08UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 256HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_512HZ                   (0x09UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 512HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_1024HZ                  (0x0AUL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 1024HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_2048HZ                  (0x0BUL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 2048HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_4096HZ                  (0x0CUL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 4096HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_8192HZ                  (0x0DUL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 8192HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_16384HZ                 (0x0EUL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 16384HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_32768HZ                 (0x0FUL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< Ouput pulse is 32768HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_ONE_PULSE                    (0x01UL << ETH_PTP_PPSCTLR_PPSFRE0_POS) /*!< One pulse is generated in single ouput mode */
/**
 * @}
 */

/**
 * @}
 */

