RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/inc/hc32_ll_eth.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup ETH_Global_Functions
 * @{
 */

/**
 * @brief  Generate MAC pause control frame.
 * @param  None
 * @retval None
 */
__STATIC_INLINE void ETH_MAC_GeneratePauseCtrlFrame(void)
{
    WRITE_REG32(bCM_ETH->MAC_FLOCTLR_b.FCA_BPA, ENABLE);
}

/**
 * @brief  Get MAC flow control status.
 * @param  None
 * @retval An @ref en_flag_status_t enumeration type value.
 */
__STATIC_INLINE en_flag_status_t ETH_MAC_GetFlowControlStatus(void)
{
    return ((en_flag_status_t)READ_REG32(bCM_ETH->MAC_FLOCTLR_b.FCA_BPA));
}

/**
 * @brief  Resume the DMA Transmit.
 * @param  None
 * @retval None
 */
__STATIC_INLINE void ETH_DMA_ResumeTrans(void)
{
    WRITE_REG32(CM_ETH->DMA_TXPOLLR, 0U);
}

/**
 * @brief  Resume the DMA Receive.
 * @param  None
 * @retval None
 */
__STATIC_INLINE void ETH_DMA_ResumeReceive(void)
{
    WRITE_REG32(CM_ETH->DMA_RXPOLLR, 0U);
}

/**
 * @brief  Get DMA error status.
 * @param  None
 * @retval uint32_t                     The new DMA error status
 *         The error status may be one of the following values:
 *           - ETH_DMA_ERR_STATE_RX_WR_DATA:    TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERR_STATE_TX_RD_DATA:    TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERR_STATE_RX_WR_DESC:    TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERR_STATE_TX_WR_DESC:    TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERR_STATE_RX_RD_DESC:    TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERR_STATE_TX_RD_DESC:    TxDMA generates error while reading descriptor
 */
__STATIC_INLINE uint32_t ETH_DMA_GetErrorStatus(void)
{
    return (READ_REG32_BIT(CM_ETH->DMA_DMASTSR, ETH_DMA_DMASTSR_EBUS));
}

/**
 * @brief  Get DMA transmit status.
 * @param  None
 * @retval uint32_t                     The new DMA transmit status
 *           The transmit status may be one of the following values:
 *           - ETH_DMA_TRANS_STATE_STOPPED:     Stopped - Reset or Stop Tx Command issued
 *           - ETH_DMA_TRANS_STATE_FETCHING:    Running - Fetching the Tx descriptor
 *           - ETH_DMA_TRANS_STATE_WAITING:     Running - Waiting for status
 *           - ETH_DMA_TRANS_STATE_READING:     Running - Reading the data from host memory
 *           - ETH_DMA_TRANS_STATE_WRITING:     Running - Writing the time stamp
 *           - ETH_DMA_TRANS_STATE_SUSPENDED:   Suspended - Tx Descriptor unavailable
 *           - ETH_DMA_TRANS_STATE_CLOSING:     Running - Closing Rx descriptor
 */
__STATIC_INLINE uint32_t ETH_DMA_GetTransStatus(void)
{
    return (READ_REG32_BIT(CM_ETH->DMA_DMASTSR, ETH_DMA_DMASTSR_TSTS));
}

/**
 * @brief  Get DMA receive status.
 * @param  None
 * @retval uint32_t                     The new DMA receive status
 *           The receive status may be one of the following values:
 *           - ETH_DMA_RX_STATE_STOPPED:    Stopped - Reset or Stop Rx Command issued
 *           - ETH_DMA_RX_STATE_FETCHING:   Running - Fetching the Rx descriptor
 *           - ETH_DMA_RX_STATE_WAITING:    Running - Waiting for packet
 *           - ETH_DMA_RX_STATE_SUSPENDED:  Suspended - Rx Descriptor unavailable
 *           - ETH_DMA_RX_STATE_CLOSING:    Running - Closing descriptor
 *           - ETH_DMA_RX_STATE_WRITING:    Running - Writing the time stamp
 *           - ETH_DMA_RX_STATE_QUEUING:    Running - Queuing the receive frame into host memory
 */
__STATIC_INLINE uint32_t ETH_DMA_GetReceiveStatus(void)
{
    return (READ_REG32_BIT(CM_ETH->DMA_DMASTSR, ETH_DMA_DMASTSR_RSTS));
}

/**
 * @brief  Get DMA Rx Overflow Missed Frame Counter value.
 * @param  None
 * @retval uint32_t                     Rx Overflow Missed Frame Counter value
 */
__STATIC_INLINE uint32_t ETH_DMA_GetOvfMissFrameCount(void)
{
    return ((READ_REG32_BIT(CM_ETH->DMA_RFRCNTR, ETH_DMA_RFRCNTR_OVFCNT)) >> ETH_DMA_RFRCNTR_OVFCNT_POS);
}

/**
 * @brief  Get DMA Buffer Unavailable Missed Frame Counter value.
 * @param  None
 * @retval uint32_t                     Buffer Unavailable Missed Frame Counter value
 */
__STATIC_INLINE uint32_t ETH_DMA_GetBufUnavailableMissFrameCount(void)
{
    return (READ_REG32_BIT(CM_ETH->DMA_RFRCNTR, ETH_DMA_RFRCNTR_UNACNT));
}

/**
 * @brief  Get DMA current Tx descriptor start address.
 * @param  None
 * @retval uint32_t                     Transmit descriptor start address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurrentTxDescAddr(void)
{
    return (READ_REG32(CM_ETH->DMA_CHTXDER));
}

/**
 * @brief  Get DMA current Rx descriptor start address.
 * @param  None
 * @retval uint32_t                     Receive descriptor start address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurrentRxDescAddr(void)
{
    return (READ_REG32(CM_ETH->DMA_CHRXDER));
}

/**
 * @brief  Get DMA current Tx buffer address.
 * @param  None
 * @retval uint32_t                     Transmit buffer address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurrentTxBufAddr(void)
{
    return (READ_REG32(CM_ETH->DMA_CHTXBFR));
}

/**
 * @brief  Get DMA current Rx buffer address.
 * @param  None
 * @retval uint32_t                     Receive buffer address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurrentRxBufAddr(void)
{
    return (READ_REG32(CM_ETH->DMA_CHRXBFR));
}

/**
 * @brief  Get PMT wakeup frame filter register pointer index.
 * @param  None
 * @retval uint8_t                      Filter register pointer index.
 */
__STATIC_INLINE uint8_t ETH_PMT_GetWakeupFramePointerIndex(void)
{
    return ((uint8_t)(READ_REG32_BIT(CM_ETH->MAC_PMTCTLR, ETH_MAC_PMTCTLR_RTWKPT) >> ETH_MAC_PMTCTLR_RTWKPT_POS));
}

/**
 * @brief  Get PTP snapshot frame type.
 * @param  None
 * @retval uint32_t                     Receive frame type
 */
__STATIC_INLINE uint32_t ETH_PTP_GetSnapFrameType(void)
{
    return (READ_REG32_BIT(CM_ETH->PTP_TSPCTLR, ETH_PTP_FRAME_TYPE_ALL));
}

int32_t ETH_DeInit(void);
int32_t ETH_Init(stc_eth_handle_t *pstcEthHandle, stc_eth_init_t *pstcEthInit);
int32_t ETH_CommStructInit(stc_eth_comm_init_t *pstcCommInit);
int32_t ETH_StructInit(stc_eth_init_t *pstcEthInit);
int32_t ETH_Start(void);
int32_t ETH_Stop(void);

/* PHY Functions */
int32_t ETH_PHY_WriteReg(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t u16Value);
int32_t ETH_PHY_ReadReg(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t *pu16Value);
int32_t ETH_PHY_LoopBackCmd(stc_eth_handle_t *pstcEthHandle, en_functional_state_t enNewState);

/* MAC Functions */
void ETH_MAC_DeInit(void);
int32_t ETH_MAC_Init(stc_eth_handle_t *pstcEthHandle, const stc_eth_mac_init_t *pstcMacInit);
int32_t ETH_MAC_StructInit(stc_eth_mac_init_t *pstcMacInit);
void ETH_MAC_SetInterface(uint32_t u32Interface);
void ETH_MAC_SetDuplexSpeed(uint32_t u32Mode, uint32_t u32Speed);
void ETH_MAC_SetHashTable(uint32_t u32HashHigh, uint32_t u32HashLow);
void ETH_MAC_SetTxVlanTagValue(uint16_t u16TxTag);
void ETH_MAC_SetRxVlanTagValue(uint16_t u16RxTag);
void ETH_MAC_SetRxVlanHashTable(uint16_t u16HashValue);
void ETH_MAC_LoopBackCmd(en_functional_state_t enNewState);
void ETH_MAC_GeneratePauseCtrlFrame(void);
void ETH_MAC_BackPressureCmd(en_functional_state_t enNewState);
void ETH_MAC_TransCmd(en_functional_state_t enNewState);
void ETH_MAC_ReceiveCmd(en_functional_state_t enNewState);
void ETH_MAC_IntCmd(uint32_t u32IntType, en_functional_state_t enNewState);
en_flag_status_t ETH_MAC_GetIntStatus(uint32_t u32Flag);
en_flag_status_t ETH_MAC_GetFlowControlStatus(void);

/* MAC Address Functions */
void ETH_MACADDR_DeInit(uint32_t u32Index);
int32_t ETH_MACADDR_Init(uint32_t u32Index, const stc_eth_mac_addr_config_t *pstcMacAddrInit);
int32_t ETH_MACADDR_StructInit(stc_eth_mac_addr_config_t *pstcMacAddrInit);
int32_t ETH_MACADDR_SetAddr(uint32_t u32Index, uint8_t au8Addr[]);
int32_t ETH_MACADDR_GetAddr(uint32_t u32Index, uint8_t au8Addr[]);
void ETH_MACADDR_SetFilterMode(uint32_t u32Index, uint32_t u32Mode);
void ETH_MACADDR_SetFilterMask(uint32_t u32Index, uint32_t u32Mask);

/* MAC L3L4 Filter Functions */
void ETH_MAC_L3L4FilterDeInit(void);
int32_t ETH_MAC_L3L4FilterInit(const stc_eth_l3l4_filter_config_t *pstcL3L4FilterInit);
int32_t ETH_MAC_L3L4FilterStructInit(stc_eth_l3l4_filter_config_t *pstcL3L4FilterInit);
void ETH_MAC_L3L4FilterCmd(en_functional_state_t enNewState);
void ETH_MAC_SetPortFilterProtocol(uint32_t u32Protocol);
void ETH_MAC_SetDestPortFilterValue(uint16_t u16Port);
void ETH_MAC_SetSrcPortFilterValue(uint16_t u16Port);
void ETH_MAC_SetAddrFilterProtocol(uint32_t u32Protocol);
void ETH_MAC_SetIpv4DestAddrFilterValue(uint32_t u32Addr);
void ETH_MAC_SetIpv4SrcAddrFilterValue(uint32_t u32Addr);
int32_t ETH_MAC_SetIpv6AddrFilterValue(const uint32_t au32Addr[]);

/* DMA Functions */
void ETH_DMA_DeInit(void);
int32_t ETH_DMA_Init(const stc_eth_dma_init_t *pstcDmaInit);
int32_t ETH_DMA_StructInit(stc_eth_dma_init_t *pstcDmaInit);
int32_t ETH_DMA_SoftwareReset(void);
void ETH_DMA_ResumeTrans(void);
void ETH_DMA_ResumeReceive(void);
void ETH_DMA_SetTransPriorityRatio(uint32_t u32Ratio);
void ETH_DMA_SetRxWatchdogCounter(uint8_t u8Value);
int32_t ETH_DMA_FlushTransFIFO(void);
void ETH_DMA_TransCmd(en_functional_state_t enNewState);
void ETH_DMA_ReceiveCmd(en_functional_state_t enNewState);
void ETH_DMA_IntCmd(uint32_t u32IntType, en_functional_state_t enNewState);
en_flag_status_t ETH_DMA_GetStatus(uint32_t u32Flag);
void ETH_DMA_ClearStatus(uint32_t u32Flag);
uint32_t ETH_DMA_GetErrorStatus(void);
uint32_t ETH_DMA_GetTransStatus(void);
uint32_t ETH_DMA_GetReceiveStatus(void);
en_flag_status_t ETH_DMA_GetOvfStatus(uint32_t u32Flag);
uint32_t ETH_DMA_GetOvfMissFrameCount(void);
uint32_t ETH_DMA_GetBufUnavailableMissFrameCount(void);
uint32_t ETH_DMA_GetCurrentTxDescAddr(void);
uint32_t ETH_DMA_GetCurrentRxDescAddr(void);
uint32_t ETH_DMA_GetCurrentTxBufAddr(void);
uint32_t ETH_DMA_GetCurrentRxBufAddr(void);

/* DMA descriptor Functions */
int32_t ETH_DMA_TxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcTxDescTab[],
                               const uint8_t au8TxBuf[], uint32_t u32TxBufCnt);
int32_t ETH_DMA_RxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcRxDescTab[],
                               const uint8_t au8RxBuf[], uint32_t u32RxBufCnt);
int32_t ETH_DMA_SetTransFrame(stc_eth_handle_t *pstcEthHandle, uint32_t u32FrameLen);
int32_t ETH_DMA_GetReceiveFrame(stc_eth_handle_t *pstcEthHandle);
int32_t ETH_DMA_GetReceiveFrame_Int(stc_eth_handle_t *pstcEthHandle);
int32_t ETH_DMA_SetTxDescOwn(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Owner);
int32_t ETH_DMA_SetTxDescBufSize(stc_eth_dma_desc_t *pstcTxDesc, uint8_t u8BufNum, uint32_t u32BufSize);
int32_t ETH_DMA_TxDescChecksumInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32ChecksumMode);
int32_t ETH_DMA_TxDescVlanInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32VlanMode);
int32_t ETH_DMA_TxDescSrcAddrInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Mode);
int32_t ETH_DMA_TxDescCrcCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState);
int32_t ETH_DMA_TxDescPadCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState);
int32_t ETH_DMA_TxDescTimestamp(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState);
int32_t ETH_DMA_TxDescReplaceCrcCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState);
int32_t ETH_DMA_TxDescIntCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState);
en_flag_status_t ETH_DMA_GetTxDescStatus(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Flag);
int32_t ETH_DMA_GetTxDescCollisionCount(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32Count);
int32_t ETH_DMA_GetTxDescTimeStamp(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32High, uint32_t *pu32Low);
int32_t ETH_DMA_SetRxDescOwn(stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Owner);
int32_t ETH_DMA_RxDescIntCmd(stc_eth_dma_desc_t *pstcRxDesc, en_functional_state_t enNewState);
en_flag_status_t ETH_DMA_GetRxDescStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag);
en_flag_status_t ETH_DMA_GetRxDescExtendStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag);
int32_t ETH_DMA_GetRxDescPayloadType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32PayloadType);
int32_t ETH_DMA_GetRxDescDatagramType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32DatagramType);
int32_t ETH_DMA_GetRxDescFrameLen(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32FrameLen);
int32_t ETH_DMA_GetRxDescBufSize(const stc_eth_dma_desc_t *pstcRxDesc, uint8_t u8BufNum, uint32_t *pu32BufSize);
int32_t ETH_DMA_GetRxDescTimeStamp(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32High, uint32_t *pu32Low);

/* MAC PMT Functions */
int32_t ETH_PMT_ResetWakeupFramePointer(void);
int32_t ETH_PMT_WriteWakeupFrameReg(const uint32_t au32RegBuf[]);
void ETH_PMT_ForwardWakeupFrameCmd(en_functional_state_t enNewState);
void ETH_PMT_WakeupSrcCmd(uint32_t u32WakeupSrc, en_functional_state_t enNewState);
int32_t ETH_PMT_EnterPowerDown(void);
en_flag_status_t ETH_PMT_GetStatus(uint32_t u32Flag);
uint8_t ETH_PMT_GetWakeupFramePointerIndex(void);

/* MMC Functions */
int32_t ETH_MMC_DeInit(void);
int32_t ETH_MMC_Init(const stc_eth_mmc_init_t *pstcMmcInit);
int32_t ETH_MMC_StructInit(stc_eth_mmc_init_t *pstcMmcInit);
int32_t ETH_MMC_CounterReset(void);
void ETH_MMC_ResetAfterReadCmd(en_functional_state_t enNewState);
void ETH_MMC_Cmd(en_functional_state_t enNewState);
void ETH_MMC_TxIntCmd(uint32_t u32IntType, en_functional_state_t enNewState);
void ETH_MMC_RxIntCmd(uint32_t u32IntType, en_functional_state_t enNewState);
en_flag_status_t ETH_MMC_GetTxStatus(uint32_t u32Flag);
en_flag_status_t ETH_MMC_GetRxStatus(uint32_t u32Flag);
uint32_t ETH_MMC_GetReg(uint32_t u32Reg);

/* PTP Functions */
void ETH_PTP_DeInit(void);
int32_t ETH_PTP_Init(const stc_eth_ptp_init_t *pstcPtpInit);
int32_t ETH_PTP_StructInit(stc_eth_ptp_init_t *pstcPtpInit);
void ETH_PTP_SetSnapDatagramType(uint32_t u32DatagramType);
void ETH_PTP_SetSnapFrameType(uint32_t u32FrameType);
uint32_t ETH_PTP_GetSnapFrameType(void);
void ETH_PTP_SetCalibMode(uint32_t u32CalibMode);
int32_t ETH_PTP_UpdateBasicAddend(void);
int32_t ETH_PTP_UpdateSysTime(void);
int32_t ETH_PTP_SysTimeInit(void);
int32_t ETH_PTP_GetSysTime(uint32_t *pu32Sec, uint32_t *pu32Subsec);
void ETH_PTP_SetBasicAddend(uint32_t u32BasicAddend, uint8_t u8SubsecAddend);
int32_t ETH_PTP_GetBasicAddend(uint32_t *pu32BasicAddend, uint8_t *pu8SubsecAddend);
void ETH_PTP_SetUpdateTime(uint32_t u32Sign, uint32_t u32Sec, uint32_t u32Subsec);
void ETH_PTP_Cmd(en_functional_state_t enNewState);
void ETH_PTP_IntCmd(en_functional_state_t enNewState);
en_flag_status_t ETH_PTP_GetStatus(uint32_t u32Flag);

/* PTP PPS Functions */
void ETH_PPS_DeInit(uint8_t u8Ch);
int32_t ETH_PPS_Init(uint8_t u8Ch, const stc_eth_pps_config_t *pstcPpsInit);
int32_t ETH_PPS_StructInit(stc_eth_pps_config_t *pstcPpsInit);
void ETH_PPS_SetTargetTime(uint8_t u8Ch, uint32_t u32Sec, uint32_t u32Subsec);
void ETH_PPS_SetTriggerFunc(uint8_t u8Ch, uint32_t u32Func);
void ETH_PPS_SetPps0OutputMode(uint32_t u32Mode);
void ETH_PPS_SetPps0OutputFreq(uint32_t u32Freq);

/**
 * @}
 */

#endif /* LL_ETH_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32_LL_ETH_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
